_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СоставРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СоставРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Механизм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СоставРесурсов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.Ресурс) Тогда
		ЗаполнитьСоставИзРесурса();
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсПриИзменении(Элемент)
	ЗаполнитьСоставИзРесурса();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставИзРесурса()
	
	Объект.Рабочие.Очистить();
	Объект.Механизмы.Очистить();
	
	РабочиеРесурса = Объект.Ресурс.Рабочие.Выгрузить();
	МеханизмыРесурса = Объект.Ресурс.Механизмы.Выгрузить();
	
	Для Каждого СтрРесурса Из РабочиеРесурса Цикл
		Если НЕ СтрРесурса.Количество = 0 Тогда
			Для к = 1 по СтрРесурса.Количество Цикл
				НоваяСтрока = Объект.Рабочие.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрРесурса);  
			КонецЦикла;
		КонецЕсли;  		
	КонецЦикла;
	
	Для Каждого СтрРесурса Из МеханизмыРесурса Цикл
		Если НЕ СтрРесурса.Количество = 0 Тогда
			Для к = 1 по СтрРесурса.Количество Цикл
				НоваяСтрока = Объект.Механизмы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрРесурса);  
			КонецЦикла;
		КонецЕсли;  		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
